ruanpei1010/2demo_stm32f103/src/MC_Display.c
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        if(bMenu_index == CONTROL_MODE_MENU_1)
        {
          LCD_SetTextColor(Red);
        }        
        
        ptr = " Speed control mode";        
        LCD_DisplayStringLine(Line3,ptr);
        
        if(bMenu_index == CONTROL_MODE_MENU_1)
        {
          LCD_SetTextColor(Blue);
        }
        else //REF_SPEED_MENU
        {
          LCD_SetTextColor(Red);
        }
          
        //Compute target speed in rpm
        temp = (s16)(hSpeed_Reference * 6);                 
        Display_5DigitSignedNumber(Line7, CHAR_0, temp);
        
        if(bMenu_index != CONTROL_MODE_MENU_1)
        {
          LCD_SetTextColor(Blue);
        }
         
        //Compute measured speed in rpm
#ifdef ENCODER
        temp = (s16)(ENC_Get_Mechanical_Speed() * 6);
#endif        
#if defined HALL_SENSORS
        temp = (s16)(HALL_GetSpeed() * 6);
#endif
#if defined NO_SPEED_SENSORS        
        temp = (s16)(STO_Get_Speed_Hz() * 6);
#endif        
        Display_5DigitSignedNumber(Line7, CHAR_13, temp); 

        temp = (ADC2_RegularConvertedValueTab[0] /32) * 6;
        Display_5DigitSignedNumber(Line2, CHAR_10, temp);

      
      break;
          
      case(VISUALIZATION_2):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "       Speed        ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I     D   ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target        (rpm)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured      (rpm)";
          LCD_DisplayStringLine(Line7,ptr);
                    
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_SPEED_MENU):
            LCD_SetTextColor(Red);            
            temp = PID_Speed_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            LCD_SetTextColor(Blue);
            
            temp = PID_Speed_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Speed_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif         
 
         break;
            
          case(I_SPEED_MENU):                                 
            temp = PID_Speed_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Red);   
            temp = PID_Speed_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Speed_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif
	      break;
          
#ifdef DIFFERENTIAL_TERM_ENABLED
            case(D_SPEED_MENU):
              temp = PID_Speed_InitStructure.hKp_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_1, temp);
              
              temp = PID_Speed_InitStructure.hKi_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_7, temp);
              
              LCD_SetTextColor(Red);
              temp = PID_Speed_InitStructure.hKd_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_13, temp);
              LCD_SetTextColor(Blue);
          
            break;
#endif
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured speeds
        
        //Display target speed in rpm
        temp = (s16)(hSpeed_Reference * 6);          
        Display_5DigitSignedNumber(Line6, CHAR_9, temp);
        
        //Compute measured speed in rpm
#ifdef ENCODER
        temp = (s16)(ENC_Get_Mechanical_Speed() * 6);
#elif defined HALL_SENSORS
        temp = (s16)(HALL_GetSpeed() * 6);
#elif defined NO_SPEED_SENSORS        
        temp = (s16)(STO_Get_Speed_Hz() * 6);
#endif
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);         
      break;
      
      case(VISUALIZATION_3):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "       Torque       ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I     D   ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target         (Iq)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured       (Iq)";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_TORQUE_MENU):
            LCD_SetTextColor(Red);            
            temp = PID_Torque_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            LCD_SetTextColor(Blue);
            
            temp = PID_Torque_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Torque_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif       
         break;
            
          case(I_TORQUE_MENU):                                 
            temp = PID_Torque_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Red);   
            temp = PID_Torque_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            
#ifdef DIFFERENTIAL_TERM_ENABLED             
            temp = PID_Torque_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif
           break;
          
#ifdef DIFFERENTIAL_TERM_ENABLED 
            case(D_TORQUE_MENU):
              temp = PID_Torque_InitStructure.hKp_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_1, temp);
              
              temp = PID_Torque_InitStructure.hKi_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_7, temp);
              
              LCD_SetTextColor(Red);
              temp = PID_Torque_InitStructure.hKd_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_13, temp);
              LCD_SetTextColor(Blue);
              
            break;
#endif
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured Iq
        
        temp = hTorque_Reference;          
        Display_5DigitSignedNumber(Line6, CHAR_9, temp);

