ruanpei1010/2demo_stm32f103/src/MC_Display.c
        temp = Stat_Curr_q_d.qI_Component1;
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);        
      break;
     
       case(VISUALIZATION_4):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "        Flux        ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I     D   ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target         (Id)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured       (Id)";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_FLUX_MENU):
            LCD_SetTextColor(Red);            
            temp = PID_Flux_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            LCD_SetTextColor(Blue);
            
            temp = PID_Flux_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
#ifdef DIFFERENTIAL_TERM_ENABLED            
            temp = PID_Flux_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif       
          break;
            
          case(I_FLUX_MENU):                                 
            temp = PID_Flux_InitStructure.hKp_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Red);   
            temp = PID_Flux_InitStructure.hKi_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            
#ifdef DIFFERENTIAL_TERM_ENABLED             
            temp = PID_Flux_InitStructure.hKd_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_13, temp);
#else        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
#endif
           break;
            
#ifdef DIFFERENTIAL_TERM_ENABLED 
            case(D_FLUX_MENU):
              temp = PID_Flux_InitStructure.hKp_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_1, temp);
              
              temp = PID_Flux_InitStructure.hKi_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_7, temp);
              
              LCD_SetTextColor(Red);
              temp = PID_Flux_InitStructure.hKd_Gain;
              Display_5DigitSignedNumber(Line4, CHAR_13, temp);
              LCD_SetTextColor(Blue);
              
            break;
#endif
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured Id
        
        temp = hFlux_Reference;          
        Display_5DigitSignedNumber(Line6, CHAR_9, temp);

        temp = Stat_Curr_q_d.qI_Component2;
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);   
      break;

#ifdef FLUX_WEAKENING      
      case(VISUALIZATION_11):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "Flux Weakening Ctrl ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "    P     I         ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
          LCD_ClearLine(Line5);
           
          ptr = " Target        (Vs%)";
          LCD_DisplayStringLine(Line6,ptr); 
          
          ptr = " Measured      (Vs%)";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(P_VOLT_MENU):
            LCD_SetTextColor(Red);            
            temp = hFW_P_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            
            LCD_SetTextColor(Blue);            
            temp = hFW_I_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            temp = hFW_V_Ref;
            Display_5DigitSignedNumber(Line6, CHAR_9, temp);
            LCD_DrawRect(161,97,1,2);            
            
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
 
         break;
            
          case(I_VOLT_MENU):                                 
            temp = hFW_P_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            temp = hFW_V_Ref;
            Display_5DigitSignedNumber(Line6, CHAR_9, temp);            
            
            LCD_SetTextColor(Red);   
            temp = hFW_I_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            LCD_SetTextColor(Blue);
            LCD_DrawRect(161,97,1,2); 
        
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }

	      break;
              
          case(TARGET_VOLT_MENU):
            LCD_SetTextColor(Red);            
            temp = hFW_V_Ref;
            Display_5DigitSignedNumber(Line6, CHAR_9, temp);
            LCD_DrawRect(161,97,1,2);
            
            LCD_SetTextColor(Blue);
            temp = hFW_P_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_1, temp);
            temp = hFW_I_Gain;
            Display_5DigitSignedNumber(Line4, CHAR_7, temp);
            
            {
              u32 i=0;
              for( i=0; i<5; i++)
              {
                LCD_DisplayChar(Line4, (u16)(320 -(16*(18-i))),'-');
              }
            }
 
         break;              
          
        default:
          break;
        }
        //Independently from the menu, this visualization must display current 
        //and measured voltage level
        
