ruanpei1010/2demo_stm32f103/src/MC_Display.c
        //Compute applied voltage in s16
        temp = (s16)(((s32)(hVMagn)*1000)/MAX_MODULE);        
        Display_5DigitSignedNumber(Line7, CHAR_9, temp);
        LCD_DrawRect(185,97,1,2);
      break;
#endif      
      
      case(VISUALIZATION_5):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          LCD_ClearLine(Line2);
          
          ptr = " Power Stage Status ";          
          LCD_DisplayStringLine(Line3, ptr); 
          
          LCD_ClearLine(Line4);
          
          ptr = "  DC bus =     Volt ";          
          LCD_DisplayStringLine(Line5, ptr); 
 
          LCD_ClearLine(Line6);
          
          ptr = "  T =      Celsius  ";          
          LCD_DisplayStringLine(Line7, ptr); 
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move            ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
      
        temp = MCL_Compute_BusVolt();        
        LCD_DisplayChar(Line5, 320-16*CHAR_11, (u8)(((temp%1000)/100)+0x30));
        LCD_DisplayChar(Line5, 320-16*CHAR_12, (u8)(((temp%100)/10)+0x30));
        LCD_DisplayChar(Line5, 320-16*CHAR_13, (u8)((temp%10)+0x30));
        
        temp = MCL_Compute_Temp(); 
        LCD_DisplayChar(Line7, 320-16*CHAR_6, (u8)(((temp%1000)/100)+0x30));
        LCD_DisplayChar(Line7, 320-16*CHAR_7, (u8)(((temp%100)/10)+0x30));
        LCD_DisplayChar(Line7, 320-16*CHAR_8, (u8)((temp%10)+0x30));

        break;    
//这里显示电位器和其他辅助变量的值
      case(VISUALIZATION_12):
	     if (bPresent_Visualization != bPrevious_Visualization)
        {           
          LCD_ClearLine(Line2);
          LCD_ClearLine(Line3);
          LCD_ClearLine(Line5);
          LCD_ClearLine(Line7);

          ptr = " ADC & LCD_LIGHT ";          
          LCD_DisplayStringLine(Line3, ptr); 
          
          LCD_ClearLine(Line4);
          
          ptr = " Pot1_V =       V ";     
 //         LCD_SetTextColor(Green);            
          LCD_DisplayStringLine(Line5, ptr); 
          
          ptr = " CPU_TT =       V ";          
          LCD_DisplayStringLine(Line6, ptr); 
          
          ptr = " BUS_CC =       V ";          
          LCD_DisplayStringLine(Line7, ptr); 
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move            ";          
          LCD_DisplayStringLine(Line9, ptr); 
         }
        temp = ADC2_RegularConvertedValueTab[0] ;
        Display_5DigitSignedNumber(Line5, CHAR_10, temp);

		//  这里设置TFT_LCD背光亮度。
        TIM_SetCompare3(TIM4, temp - 70); 

        temp = ADC1_RegularConvertedValueTab[0] ;       
        Display_5DigitSignedNumber(Line6, CHAR_10, temp);

        temp = ADC1_RegularConvertedValueTab[2] ;      
        Display_5DigitSignedNumber(Line7, CHAR_10, temp);
   
      break;    
        
      case(VISUALIZATION_6):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
#ifdef NO_SPEED_SENSORS          
          ptr = "   Sensorless Demo  ";
          LCD_DisplayStringLine(Line2,ptr);
#else          
          LCD_ClearLine(Line2);
#endif           
          LCD_ClearLine(Line3); 
          
          ptr = "     Target Measured";
          LCD_DisplayStringLine(Line4,ptr);
          
          ptr = "Iq                  ";
          LCD_DisplayStringLine(Line5,ptr); 
          
          ptr = "Id                  ";
          LCD_DisplayStringLine(Line6,ptr);
          
          ptr = "Speed (rpm)         ";
          LCD_DisplayStringLine(Line7,ptr);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(CONTROL_MODE_MENU_6):
            LCD_SetTextColor(Red);
            ptr = "Torque control mode ";        
            LCD_DisplayStringLine(Line3,ptr);  
            LCD_SetTextColor(Blue);
            
            temp = hTorque_Reference;
            Display_5DigitSignedNumber(Line5, CHAR_5, temp);
 
            temp = hFlux_Reference; 
            Display_5DigitSignedNumber(Line6, CHAR_5, temp);         
          break;   
          
          case(IQ_REF_MENU):
            ptr = "Torque control mode ";
            LCD_DisplayStringLine(Line3,ptr); 
            
            LCD_SetTextColor(Red);
            temp = hTorque_Reference;
            Display_5DigitSignedNumber(Line5, CHAR_5, temp);
            LCD_SetTextColor(Blue);
            
            temp = hFlux_Reference; 
            Display_5DigitSignedNumber(Line6, CHAR_5, temp); 
          break;
            
          case(ID_REF_MENU):
            ptr = "Torque control mode ";
            LCD_DisplayStringLine(Line3,ptr); 
            
            temp = hTorque_Reference;
            Display_5DigitSignedNumber(Line5, CHAR_5, temp);
            
            LCD_SetTextColor(Red);
            temp = hFlux_Reference; 
            Display_5DigitSignedNumber(Line6, CHAR_5, temp); 
            LCD_SetTextColor(Blue);
          break;
         default: 
          break;
        }            
        temp =Stat_Curr_q_d.qI_Component1;
        Display_5DigitSignedNumber(Line5, CHAR_13, temp);
        
        temp =Stat_Curr_q_d.qI_Component2;        
        Display_5DigitSignedNumber(Line6, CHAR_13, temp);

        //Compute measured speed in rpm
#ifdef ENCODER
        temp = (s16)(ENC_Get_Mechanical_Speed() * 6);
#elif defined HALL_SENSORS
        temp = (s16)(HALL_GetSpeed() * 6);
#elif defined NO_SPEED_SENSORS        
        temp = (s16)(STO_Get_Speed_Hz() * 6);
#endif 
        Display_5DigitSignedNumber(Line7, CHAR_13, temp);
      break;
        
      case(VISUALIZATION_7):
        if (bPresent_Visualization != bPrevious_Visualization)
        {  
          LCD_ClearLine(Line2);
          
          LCD_SetTextColor(Red);
          ptr = "    !!! FAULT !!!   ";
          LCD_DisplayStringLine(Line3,ptr);
          LCD_SetTextColor(Blue);
         
          if ( (wGlobal_Flags & UNDER_VOLTAGE) == UNDER_VOLTAGE)
          {           
            ptr = " Bus Under Voltage  ";
            LCD_DisplayStringLine(Line4, ptr);                                   
          }
          else if ( (wGlobal_Flags & OVER_CURRENT) ==  OVER_CURRENT)
            {
              ptr = "   Over Current    ";
              LCD_DisplayStringLine(Line4, ptr); 
            }
          else if ( (wGlobal_Flags & OVERHEAT) ==  OVERHEAT)
            {
              ptr = "   Over Heating    ";
              LCD_DisplayStringLine(Line4, ptr);                             
            }
          else if ( (wGlobal_Flags & OVER_VOLTAGE) ==  OVER_VOLTAGE)
            {
              ptr = "  Bus Over Voltage  ";
              LCD_DisplayStringLine(Line4, ptr);               
            }
          else if ( (wGlobal_Flags & START_UP_FAILURE) ==  START_UP_FAILURE)
          {
             ptr = "  Start-up failed   ";
             LCD_DisplayStringLine(Line4, ptr);    
          }      
          else if ( (wGlobal_Flags & SPEED_FEEDBACK) ==  SPEED_FEEDBACK)
          {
             ptr = "Error on speed fdbck";
             LCD_DisplayStringLine(Line4, ptr);     
          }  
          LCD_ClearLine(Line5);
          LCD_ClearLine(Line7);  
        } 

