ruanpei1010/2demo_stm32f103/src/MC_Display.c
        if ((wGlobal_Flags & ( OVERHEAT | UNDER_VOLTAGE | OVER_VOLTAGE)) == 0) 
        { 
          LCD_ClearLine(Line6);
          ptr = "   Press 'Key' to   ";
          LCD_DisplayStringLine(Line8,ptr);
          
          ptr = "   return to menu   ";
          LCD_DisplayStringLine(Line9,ptr);
        }
        else
        {
          if ((wGlobal_Flags & (UNDER_VOLTAGE | OVER_VOLTAGE)) ==0)    
          {//Under or over voltage
             if (bPresent_Visualization != bPrevious_Visualization)
             { 
               LCD_ClearLine(Line6);
             }
             temp = MCL_Compute_Temp(); 
             ptr = "       T =";  
             LCD_DisplayStringLine(Line6, ptr);
             LCD_DisplayChar(Line6, 320-16*CHAR_11, (u8)(((temp%1000)/100)+0x30));
             LCD_DisplayChar(Line6, 320-16*CHAR_12, (u8)(((temp%100)/10)+0x30));
             LCD_DisplayChar(Line6, 320-16*CHAR_13, (u8)((temp%10)+0x30));
             LCD_DisplayChar(Line6, 320-16*CHAR_14, ' ');
             LCD_DisplayChar(Line6, 320-16*CHAR_15, 'C');
          }
          else 
          {           
            if (bPresent_Visualization != bPrevious_Visualization)
            { 
              LCD_ClearLine(Line6);         
            }
            ptr = "  DC bus =";            
            LCD_DisplayStringLine(Line6, ptr); 
            temp = MCL_Compute_BusVolt();        
            LCD_DisplayChar(Line6, 320-16*CHAR_11, (u8)(((temp%1000)/100)+0x30));
            LCD_DisplayChar(Line6, 320-16*CHAR_12, (u8)(((temp%100)/10)+0x30));
            LCD_DisplayChar(Line6, 320-16*CHAR_13, (u8)((temp%10)+0x30)); 
            LCD_DisplayChar(Line6, 320-16*CHAR_14, ' ');
            LCD_DisplayChar(Line6, 320-16*CHAR_15, 'V');             
          }          
          LCD_ClearLine(Line8);
          LCD_ClearLine(Line9);
        }
      break;
     
      case(VISUALIZATION_8):  
        if (bPresent_Visualization != bPrevious_Visualization)
        {  
          LCD_ClearLine(Line2);
          
          ptr = " Motor is stopping  ";
          LCD_DisplayStringLine(Line3,ptr);
          
          ptr = "   please wait...   ";
          LCD_DisplayStringLine(Line4,ptr);
          
          LCD_ClearLine(Line5);
          LCD_ClearLine(Line6);
          LCD_ClearLine(Line7);
          LCD_ClearLine(Line8);
          LCD_ClearLine(Line9);
        } 
      break;

#ifdef OBSERVER_GAIN_TUNING      
      case(VISUALIZATION_9):
        if (bPresent_Visualization != bPrevious_Visualization)
        {           
          ptr = "   Observer Gains   ";
          LCD_DisplayStringLine(Line2,ptr);
          
          ptr = "     K1       K2    ";
          LCD_DisplayStringLine(Line3,ptr); 
          
          LCD_ClearLine(Line4);
           
          ptr = "      PLL Gains     ";
          LCD_DisplayStringLine(Line5,ptr); 
          
          ptr = "     P        I     ";
          LCD_DisplayStringLine(Line6,ptr);
          
          LCD_ClearLine(Line7);
          
          LCD_ClearLine(Line8);
          
          ptr = " <> Move  ^| Change ";          
          LCD_DisplayStringLine(Line9, ptr); 
        }
        
        switch(bMenu_index)
        {
          case(K1_MENU):
            LCD_SetTextColor(Red);            
            temp = wK1_LO/10;
            Display_5DigitSignedNumber(Line4, CHAR_3, temp);
            
            LCD_SetTextColor(Blue);
            temp = wK2_LO/100;
            Display_5DigitSignedNumber(Line4, CHAR_12, temp);
                      
            temp = hPLL_P_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_3, temp);  
            
            temp = hPLL_I_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_12, temp);
          break;
                     
           case(K2_MENU):              
            temp = wK1_LO/10;
            Display_5DigitSignedNumber(Line4, CHAR_3, temp);
            
            LCD_SetTextColor(Red);  
            temp = wK2_LO/100;
            Display_5DigitSignedNumber(Line4, CHAR_12, temp);
            
            LCD_SetTextColor(Blue);           
            temp = hPLL_P_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_3, temp);  
            
            temp = hPLL_I_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_12, temp);
          break;
            
          case(P_PLL_MENU):
            temp = wK1_LO/10;
            Display_5DigitSignedNumber(Line4, CHAR_3, temp);
             
            temp = wK2_LO/100;
            Display_5DigitSignedNumber(Line4, CHAR_12, temp);
            
            LCD_SetTextColor(Red);           
            temp = hPLL_P_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_3, temp);  
            
            LCD_SetTextColor(Blue); 
            temp = hPLL_I_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_12, temp);
          break;
            
          case(I_PLL_MENU):
            temp = wK1_LO/10;
            Display_5DigitSignedNumber(Line4, CHAR_3, temp);
             
            temp = wK2_LO/100;
            Display_5DigitSignedNumber(Line4, CHAR_12, temp);
                       
            temp = hPLL_P_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_3, temp);  
            
            LCD_SetTextColor(Red);
            temp = hPLL_I_Gain;
            Display_5DigitSignedNumber(Line7, CHAR_12, temp);                  
            LCD_SetTextColor(Blue); 
          break;  
        default:
           break;
        }
        break;
#endif
      
#ifdef DAC_FUNCTIONALITY      
    case(VISUALIZATION_10):
      if (bPresent_Visualization != bPrevious_Visualization)
      {           
        LCD_ClearLine(Line2);
        
        ptr = "    Signal on PB0   ";
        LCD_DisplayStringLine(Line3,ptr); 
        
        LCD_ClearLine(Line4);
         
        LCD_ClearLine(Line5);
        
